tap "homebrew/services"
tap "buo/cask-upgrade"

# Shell
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "stow"
brew "direnv"

# CLI tools
brew "asdf"
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "gh"
brew "jq"
brew "lazygit"
brew "mas"
brew "ripgrep"
brew "thefuck"
brew "tlrc"
brew "zoxide"

# Development
brew "pnpm"
brew "stripe"
brew "biome"
brew "docker"
brew "pandoc"

# Media
brew "yt-dlp"

# Casks - Development
cask "antigravity"
cask "claude-code"
cask "github"
cask "visual-studio-code"
cask "warp"

# Casks - Browsers
cask "firefox"
cask "google-chrome"

# Casks - Productivity
cask "bitwarden"
cask "espanso"
cask "figma"
cask "granola"
cask "linear-linear"
cask "obsidian"
cask "raycast"
cask "slack"
cask "zotero"

# Casks - Media
cask "plex"
cask "plex-media-server"
cask "spotify"

# Casks - Communication
cask "discord"
cask "whatsapp"
cask "zoom"

# Casks - Utilities
cask "adobe-digital-editions"
cask "calibre"
cask "google-drive"
cask "logos"
cask "logi-options+"
cask "microsoft-office"
cask "onedrive"
cask "stats"
cask "wispr-flow"

# Fonts
cask "font-meslo-lg-nerd-font"

# Mac App Store
mas "CleanMyMac", id: 1339170533
mas "Things 3", id: 904280696
